## Plan Result (826: deploy - PlanAndApply)




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_access_package.package[&#34;Production MySQL Administrative Access SC&#34;]
  * azuread_access_package.package[&#34;Production MySQL User Access SC&#34;]
  * azuread_access_package_assignment_policy.this[&#34;self-approval-with-justification:Production MySQL Administrative Access SC&#34;]
  * azuread_access_package_assignment_policy.this[&#34;self-approval-with-justification:Production MySQL User Access SC&#34;]
  * azuread_access_package_resource_catalog_association.this[&#34;Databases:DTS ServiceNow MySQL DB Access for Administrators&#34;]
  * azuread_access_package_resource_catalog_association.this[&#34;Databases:DTS ServiceNow MySQL DB Access for Uers&#34;]
  * azuread_access_package_resource_package_association.this[&#34;Production MySQL Administrative Access SC:Databases:DTS ServiceNow MySQL DB Access for Administrators&#34;]
  * azuread_access_package_resource_package_association.this[&#34;Production MySQL User Access SC:Databases:DTS ServiceNow MySQL DB Access for Uers&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_access_package.package["Production MySQL Administrative Access SC"] will be created
  + resource "azuread_access_package" "package" {
      + catalog_id   = "87fef47f-7b35-41f7-9519-0bd5ce5c60d3"
      + description  = "Grants admin access to MySQL SeviceNow Flexible Server"
      + display_name = "Production MySQL Administrative Access SC"
      + hidden       = false
      + id           = (known after apply)
    }

  # azuread_access_package.package["Production MySQL User Access SC"] will be created
  + resource "azuread_access_package" "package" {
      + catalog_id   = "87fef47f-7b35-41f7-9519-0bd5ce5c60d3"
      + description  = "Grants user access to MySQL SeviceNow Flexible Server"
      + display_name = "Production MySQL User Access SC"
      + hidden       = false
      + id           = (known after apply)
    }

  # azuread_access_package_assignment_policy.this["self-approval-with-justification:Production MySQL Administrative Access SC"] will be created
  + resource "azuread_access_package_assignment_policy" "this" {
      + access_package_id = (known after apply)
      + description       = "Initial Policy"
      + display_name      = "Initial Policy"
      + duration_in_days  = 1
      + extension_enabled = true
      + id                = (known after apply)

      + approval_settings {
          + approval_required                = false
          + requestor_justification_required = true
        }

      + question {
          + required = false
          + sequence = 1

          + text {
              + default_text = "Include Jira link in business justification"
            }
        }

      + requestor_settings {
          + requests_accepted = true
          + scope_type        = "SpecificDirectorySubjects"

          + requestor {
              + object_id    = "4d0554dd-fe60-424a-be9c-36636826d927"
              + subject_type = "groupMembers"
            }
        }
    }

  # azuread_access_package_assignment_policy.this["self-approval-with-justification:Production MySQL User Access SC"] will be created
  + resource "azuread_access_package_assignment_policy" "this" {
      + access_package_id = (known after apply)
      + description       = "Initial Policy"
      + display_name      = "Initial Policy"
      + duration_in_days  = 1
      + extension_enabled = true
      + id                = (known after apply)

      + approval_settings {
          + approval_required                = false
          + requestor_justification_required = true
        }

      + question {
          + required = false
          + sequence = 1

          + text {
              + default_text = "Include Jira link in business justification"
            }
        }

      + requestor_settings {
          + requests_accepted = true
          + scope_type        = "SpecificDirectorySubjects"

          + requestor {
              + object_id    = "4d0554dd-fe60-424a-be9c-36636826d927"
              + subject_type = "groupMembers"
            }
        }
    }

  # azuread_access_package_resource_catalog_association.this["Databases:DTS ServiceNow MySQL DB Access for Administrators"] will be created
  + resource "azuread_access_package_resource_catalog_association" "this" {
      + catalog_id             = "87fef47f-7b35-41f7-9519-0bd5ce5c60d3"
      + id                     = (known after apply)
      + resource_origin_id     = "050478db-f09c-49d5-a190-21745728ae38"
      + resource_origin_system = "AadGroup"
    }

  # azuread_access_package_resource_catalog_association.this["Databases:DTS ServiceNow MySQL DB Access for Uers"] will be created
  + resource "azuread_access_package_resource_catalog_association" "this" {
      + catalog_id             = "87fef47f-7b35-41f7-9519-0bd5ce5c60d3"
      + id                     = (known after apply)
      + resource_origin_id     = "2a211e8d-4a2c-4cfe-964a-2a7873116490"
      + resource_origin_system = "AadGroup"
    }

  # azuread_access_package_resource_package_association.this["Production MySQL Administrative Access SC:Databases:DTS ServiceNow MySQL DB Access for Administrators"] will be created
  + resource "azuread_access_package_resource_package_association" "this" {
      + access_package_id               = (known after apply)
      + access_type                     = "Member"
      + catalog_resource_association_id = (known after apply)
      + id                              = (known after apply)
    }

  # azuread_access_package_resource_package_association.this["Production MySQL User Access SC:Databases:DTS ServiceNow MySQL DB Access for Uers"] will be created
  + resource "azuread_access_package_resource_package_association" "this" {
      + access_package_id               = (known after apply)
      + access_type                     = "Member"
      + catalog_resource_association_id = (known after apply)
      + id                              = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":100,"Program":"tfcmt","SHA1":"","Target":"826: deploy - PlanAndApply","Vars":{}} -->